Revit 2027 API
ParameterTypeId.JoistSystemLayoutRuleParam Property
 "Layout Rule"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId JoistSystemLayoutRuleParam { get; }
Public Shared ReadOnly Property JoistSystemLayoutRuleParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ JoistSystemLayoutRuleParam {
	ForgeTypeId^ get ();
}
static member JoistSystemLayoutRuleParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace